notes/test_ruby.org
** Arguments

   ~*~ allows any number of arguments and /sponges/ arguments if
   placed between other arguments.
   Use ~=~ to supply a default value for arguments.

  | method signature                        | sample call(s)                | variable assignements                                             |
  |-----------------------------------------+-------------------------------+-------------------------------------------------------------------|
  | ~def m(*a)~                             | ~m(1,2,3)~                    | ~a = [1,2,3]~                                                     |
  | ~def m(a, b=1)~                         | ~m(2)~                        | ~a = 2, b = 1~                                                    |
  |                                         | ~m(2,3)~                      | ~a = 2, b = 3~                                                    |
  | ~def m(a, b = 2, *c, d)~                | ~m(1, 3)~                     | ~a = 1, b = 2, c = [], d = 3~                                     |
  |                                         | ~m(1, 3, 5, 7)~               | ~a = 1, b = 3, c = [5], d = 7~                                    |
  |                                         | ~m(1, 3, 5, 7, 9)~            | ~a = 1, b = 3, c = [5, 7], d = 9~                                 |
  | ~def m(a:, b:)~                         | ~m(a:1, b:2)~                 | ~a = 1, b = 2~                                                    |
  | ~def m(a: 1, b: 2)~                     | ~m~                           | ~a = 1, b = 2~                                                    |
  |                                         | ~m(3, 4)~                     | ~a = 3, b = 4~                                                    |
  | ~def m(x, y, *z, a:1, b:, **c, &block)~ | ~m(1,2,3,4,5,b:10,p:20,q:30)~ | ~x = 1, y= 2, z=[3,4,5], a = 1, b = 10, c = {:p => 20, :q => 30}~ |
  | c here absorbs unknown named arguments  |                               |                                                                   |

  When using ~Hashes~ as arguments. If it is the last argument you
  can write it without curly braces

  #+BEGIN_SRC ruby
    add_to_database('Lille', country: 'France', postal_code: 62000)
  #+END_SRC

  If it is the first argument you must use parentheses (or ruby
  will think it is a block) and curly braces

  #+BEGIN_SRC ruby
    add_to_database({country => 'France', postal_code => 62000}, 'Lille')
  #+END_SRC

** Immediate values

   Some objects like /Integers/, /symbols/ and ~true~, ~false~,
   ~nil~ are stored in variables as immediate value. The variable
   holds the value itself rather than a reference to it.

   It follows that there is only one object ~1~, only one ~true~.
   And that's why there is no ~++~ operator in ruby. Because ~1++~
   means you'd be changing the number 1 to 2 and that makes no
   sense.

** Freeze, Dup and Clone
   You can freeze an object ruby to prevent and object from
   undergoing further changes.

   ~dup~ duplicates an object. ~clone~ duplicate an object and if
   the cloned object was frozen, the clone is also frozen.

* Organizing objects with classes
  Everything you handle in Ruby is either an object or a construct
  that evaluates to an object.
  Every object is an instance of some class.

  Class definitions evaluates to the last expression contained
  inside it, or ~nil~ if the block is empty.

** initialize
   Arguments used with ~new~ are automatically sent to ~initialize~.
** % sign technique
   Allows to use sprintf-like syntax. Run ri sprintf for full documentation.
   #+BEGIN_SRC ruby
     price = 2.84839849
     p "#{"%.2f" % price}"
   #+END_SRC

   #+RESULTS:
   : 2.85

** assignment-like methods

  #+BEGIN_SRC ruby
    ticket.price=(63.00)
    ticket.price = 63.00
  #+END_SRC

   The second version is syntactic sugar for the first one. It is
   important to understand and remember. ~=~ is a method (like
   other operators) and can be overloaded.

** setter methods
   They behave like assignment. They return the value of the
   expression rather than the last expression evaluated during
   execution (for example when your assignement methods returns a
   string "Hah ha!")

  #+BEGIN_SRC ruby
    class Ticket
      def price=(price)
        @price = price
        return 'ahah'
      end

    end

    if (Ticket.new.price = 65) == 65 # true
      puts 'my return value is 65' #gets printed
    end
  #+END_SRC

** attributes

  | method name     | effect                                             | example                | equivalent code   |
  | ~attr_reader~   | creates a read method                              | ~attr_reader :venue~   | def venue         |
  |                 |                                                    |                        | @venue            |
  |                 |                                                    |                        | end               |
  | ~attr_writer~   | creates a writer method                            | ~attr_writer :price~   | def price=(price) |
  |                 |                                                    |                        | @price = price    |
  |                 |                                                    |                        | end               |
  | ~attr_accessor~ | creates reader and writer method                   | ~attr_accessor :price~ |                   |
  | ~attr~          | creates a reader method                            | ~attr :venue~          |                   |
  |                 | and a writer method if the second argument is true | ~attr :price, true~    |                   |

   Those family methods are defined in /Module/

** Subclass

   ~<~ designates a subclass.

  #+BEGIN_SRC ruby
    class Publication
    end

    class Magazine < Publication
    end

  #+END_SRC

