notes/test_ruby.org
** Superclass & Modules
   A Ruby /class/ can have only one /superclass/ (/single
   inheritance/).
   Ruby provides modules that you can /mix in/ your class's family
   tree to provide as many methods for your objects as you need.

** ~BasicObject~, ~Object~ & ~Kernel~

   ~BasicObject~ comes before ~Object~ in the ruby family tree.
   ~BasicObject~ offers a blank state object. an object with
   almost no methods. At the time of writing (Ruby 2.1),
   ~BasicObject~ has 7 instance methods and ~Object~
   about 55.

   ~Kernel~ module contains the majority of the methods common to
   all objects

   ~BasicObject~, ~Object~ & ~Kernel~ are written in C. Here is a
   Ruby mockup of their relationship

  #+BEGIN_SRC ruby
    class BasicObject
      # 7 methods
    end
    module Kernel
      # over 100 method definitions
    end
    class Object < BasicObject
      include Kernel
    end
  #+END_SRC

** Methods & Constant notation

   + ~Ticket#price~: instance method ~price~ in the /class/
     ~Ticket~
   + ~Ticket.most_expensive~: /class/ method ~most_expensive~ in
     the class Ticket
   + ~Ticket::most_expensive~: /class/ method ~most_expensive~ in
     the class Ticket
   + ~Ticket::VENUES~: constant ~VENUES~ in class ~Ticket~

**  Constants

    It is possible to perform an assingment on a constant you
    already assigned.

  #+BEGIN_SRC ruby
    A = 1
    A = 2
  #+END_SRC

    You will get a warning

  #+BEGIN_SRC ruby
    venues = Ticket::VENUES
    venues << 'High School Gym'
  #+END_SRC

    no warning because there is no redefinition of a constant. We
    are modifying an array and array has no knowleged it has been
    assigned to a constant.

** ~inspect~
   You can override it and have useful info about your custom class.

* Modules and program organization

  Modules don't have instances. It follows that entities or things
  are best modeled in classes and characteristics or properties
  are best encapsulated in modules.

  The /class/ of ~Class~ and ~Module~ is /class/. The /superclass/ of
  ~Class~ is ~Module~. The /superclass/ of ~Module~ is object.

  modules get /mixed in/ to classes using ~include~ or ~prepend~.
  A /mixed in/ module is referred as a /mix in/.

#+BEGIN_SRC ruby
  class ModuleTester
    include MyFirstModule
  end
#+END_SRC

  The main difference between inheriting from a /class/ and
  /modules/ is that you can /mix in/ more that one module

** Class and Module naming

  It is common to have /class/’s name as noun and /module/’s as an adjective

  #+BEGIN_SRC ruby
    class Stack
      include Stacklike
    end
  #+END_SRC

** ~method_missing~

  Get called as a last resort for unmatched messages. You can
  override ~method_missing~

  A good example of a ~method_missing~ override:

  #+BEGIN_SRC ruby
    class Person
      def self.method_missing(m, *args)
        method = m.to_s
        if method.start_with?('all_with_')
          # Handle request here"
        else
          super
        end
      end
    end
  #+END_SRC

** including a module several times

   Re-including a /module/ does not do anything as the modle is
   already in the search path. In the following example, if /N/ and
   /M/ have some methods with the same name, the method defined in
   /N/ will be called.

  #+BEGIN_SRC ruby
    class C
      include M
      include N
      include M
    end
  #+END_SRC

** ~prepend~

   ~prepend~ appeared with Ruby 2. The difference between
   ~include~ and ~prepend~ is that when you ~prepend a module~,
   the object looks in the module first instead of looking in the
   class.

** method look-up summary

   To look for a method, an object looks in:

   1. Modules pre-pended
   2. singleton class
   3. It’s class
   4. Modules in it class
   5. Modules prepended to its superclass
   6. It’s class superclass
   7. Modules included in its superclass
   8. and so on up to ~BasicObject~

   A method defined as a singleton method of a class object can
   also be called on sub-classes of that class. The singleton
   class is considered the ancestor of the singleton class of
   sub-classes.

** ~super~

   + Called with no arguments, ~super~ automatically forwards
     arguments passed to the method from which it’s called.
   + with an empty argument list ~super()~ sends no
     argument.
   + called with specific arguments ~super(a, b, c)~ sends those
     arguments.

** Nesting modules and classes

  #+BEGIN_SRC ruby
    module Tools
      class Hammer
      end
    end
  #+END_SRC

   Used to separate namespaces for classes, modules and methods.
   However if you see a construct like ~Tools::Hammer~ you can't
   say from that construct if ~Hammer~ is a class or a module. You
   know it through the documentation or because you wrote the
   code. The notation in itself does not tell you everything.

