notes/test_ruby.org
* The default Object (self), scope & visibility

  | Context              | Example                          | Which object is self?               |
  |----------------------+----------------------------------+-------------------------------------|
  | Top level of program | Any code                         | ~main~                              |
  | Class definition     | class C                          | class object C                      |
  |                      | self                             |                                     |
  | Module definition    | module M                         | module object M                     |
  |                      | self                             |                                     |
  | Method definitions   | 1. Top level                     | whatever object is self             |
  |                      | def method_name                   | when the method is called           |
  |                      | self                             |                                     |
  |                      | 2. class instance-method         | An instance of C                    |
  |                      | class C                          |                                     |
  |                      | def method_name                   |                                     |
  |                      | self                             |                                     |
  |                      | 3. module instance-method        | - Individual oject extented by M    |
  |                      | module M                         | - Instance of class that mixes in M |
  |                      | def method_name                   |                                     |
  |                      | self                             |                                     |
  |                      | 4. Singleton method on an object | Obj                                 |
  |                      | def obj.method_name               |                                     |
  |                      | self                             |                                     |


**  Don't hard code class names.
    It is bad in case you want to rename  your class. Instead use self

  #+BEGIN_SRC ruby
    class C
      def C.y # bad
      end

      def self.x # good
      end
    end
  #+END_SRC

** instance variables
   every instance variable belongs to whatever object is the
   current object (/self) at that point.

    #+BEGIN_SRC ruby
      class C
        p self
        @v = "top level instance variable "
        p @v

        def show_v
          p self
          p @v
        end
      end

      c = C.new
      c.show_v
    #+END_SRC

   will return

    #+BEGIN_EXAMPLE
    C
    "top level instance variable"
    #<C:0x007fe37388d9d0>
    nil
    #+END_EXAMPLE

   The two variables ~@v~ are different


** built-in classes
   You can create you own /string/ class

    #+BEGIN_SRC ruby
      class MyClass
        class String

        end
        def initialize
          String.new
      end
    #+END_SRC

   Here the ~String~ used will be the new one defined in
   ~MyClass~. To use the build in Ruby ~String~ you can use ~::String.new~.
   ~::~ in front of a constant means “start the search for this at
   the top level”

** class variables (@@)

   class variables are class-hierarchy scoped.

   #+BEGIN_SRC ruby
     class Parent
       @@value = 100
     end

     class Child < Parent
       @@value = 200
     end

     class Parent
       puts @@value
     end
   #+END_SRC

   Here 200 will get printed


** public, private, protected
   you either do
   ~private :first_method, :second_method, :third_method~. To make
   those three methods private. Or Use ~private~ as a switch
   without arguments then ll methods below ~private~ in your class
   will be private.

*** private setter methods
    you can omit ~self~ when defining private access. It won't
    clash with an ipothetic class variable. Ruby is smart enough
    to understand what you mean.

    #+BEGIN_SRC ruby
      class Dog
        attr_reader :age, :dog_years
        def dog_years=(years)
          @dog_years = years
        end
        def age=(years)
          @age = years
          self.dog_years = years * 7 # = @dog_years = years * 7
        end
        private :dog_years=
      end

      luigi = Dog.new
      luigi.age = 10
    #+END_SRC

** top level method

#+BEGIN_SRC ruby
  def talk
    puts 'hello'
  end
#+END_SRC

   is equivalent to

#+BEGIN_SRC ruby
  class Object
    private
    def talk
      puts 'hello'
    end
  end
#+END_SRC
* Control-flow techniques
