notes/test_ruby.org
** if

#+BEGIN_SRC ruby
  if x > 10
    puts x
  end

  if x > 10 then puts x end

  if x > 10; puts x; end

  puts x if x > 10
#+END_SRC

   If an ~if~ statement does not suceed it returns ~nil~
   It it succeeds the entite statement evaluates to whatever is
   represented by the code in the successful branch.

** unless
   same as ~if not~ or ~if!~

** case
   At most one match will succeed and have its code executed.
   You can put more than one possible match in a single ~when~

#+BEGIN_SRC ruby
  case answer
  when 'y', 'yes'
    puts 'affirmative!'
  when 'n', 'no'
    puts 'negative!'
  else
    puts 'not sure'
  end
#+END_SRC

** /===/
   For ~String~ and any object that does not ovveride it, ~===~
   works the same as ~==~. Every class can define its own ~===~
   method. It is used in /case when/ equality logic.

** loop

   loop is an iterator. In Ruby an iterator is a method that
   expects you to provide a code block.

#+BEGIN_SRC ruby
  loop { puts 'looping forever' }

  n = 1
  loop do
    n += 1
    next unless n == 10
    break
  end
#+END_SRC

   Here is how we can write loop

#+BEGIN_SRC ruby
  def my_loop
    yield while true
  end
#+END_SRC

** while and until modifiers

#+BEGIN_SRC ruby
  n += 1 until n == 10
  n += 1 while n < 10
#+END_SRC

** for

#+BEGIN_SRC ruby
  numbers = [0, 10, 20, 30, 40, 50]
  for n in numbers
    puts n
  end
#+END_SRC

** curly braces vs do/end code block

   The difference between the two is a difference in precedence

#+BEGIN_SRC ruby
  puts [1, 2, 3].map { |n| n * 10 }
  # is like
  puts ([1, 2, 3].map { |n| n * 10 })
#+END_SRC
   will ouput 10, 20 , 30

#+BEGIN_SRC ruby
  puts [1, 2, 3].map do |n| n * 10 end
  # is like
  puts ([1, 2, 3].map) do |n| n * 10 end
  # is like
  puts [1, 2, 3].map
#+END_SRC
   will output an enumerator

** each and map

   - ~each~ returns its receiver
   - ~map~ returns a new array


**  Block parameters and scope

    If you have a variable of a given name in scope and also use
    that name as one of your block parameters, then the two
    variables are not the same as each other.
    You can use this to your advantage to make sure a temporary
    variable inside a block does not reuse a variable from outside
    the block

#+BEGIN_SRC ruby
  x = "original x"
  3.times do |i;x|
    x = i
  end
  x
#+END_SRC

#+RESULTS:
: original x

    ~;~ indicates the block needs its own x.

** rescue

#+BEGIN_SRC ruby
  begin
    #some code
  rescue ArgumentError => e
  #rescue code
    puts e.backtrace
    puts e.message
  ensure
    #make sure this runs
  end
#+END_SRC

   if you put rescue at the end of a method you don't need to say
   begin explicitely. Recue will govern the entire method block

#+BEGIN_SRC ruby
  def method_name
    puts 'hello'
    rescue
    puts 'rescued'
  end
#+END_SRC
