notes/test_ruby.html
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> if</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">if</span> x &gt; 10
  <span style="color: #483d8b;">puts</span> x
<span style="color: #a020f0;">end</span>

<span style="color: #a020f0;">if</span> x &gt; 10 <span style="color: #a020f0;">then</span> <span style="color: #483d8b;">puts</span> x <span style="color: #a020f0;">end</span>

<span style="color: #a020f0;">if</span> x &gt; 10; <span style="color: #483d8b;">puts</span> x; <span style="color: #a020f0;">end</span>

<span style="color: #483d8b;">puts</span> x <span style="color: #a020f0;">if</span> x &gt; 10
</pre>
</div>

<p>
If an <code>if</code> statement does not suceed it returns <code>nil</code>
It it succeeds the entite statement evaluates to whatever is
represented by the code in the successful branch.
</p>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> unless</h3>
<div class="outline-text-3" id="text-6-2">
<p>
same as <code>if not</code> or <code>if!</code>
</p>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> case</h3>
<div class="outline-text-3" id="text-6-3">
<p>
At most one match will succeed and have its code executed.
You can put more than one possible match in a single <code>when</code>
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">case</span> answer
<span style="color: #a020f0;">when</span> <span style="color: #8b2252;">'y'</span>, <span style="color: #8b2252;">'yes'</span>
  <span style="color: #483d8b;">puts</span> <span style="color: #8b2252;">'affirmative!'</span>
<span style="color: #a020f0;">when</span> <span style="color: #8b2252;">'n'</span>, <span style="color: #8b2252;">'no'</span>
  <span style="color: #483d8b;">puts</span> <span style="color: #8b2252;">'negative!'</span>
<span style="color: #a020f0;">else</span>
  <span style="color: #483d8b;">puts</span> <span style="color: #8b2252;">'not sure'</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> <i><code>=</code></i></h3>
<div class="outline-text-3" id="text-6-4">
<p>
For <code>String</code> and any object that does not ovveride it, <code>===</code>
works the same as <code>==</code>. Every class can define its own <code>===</code>
method. It is used in <i>case when</i> equality logic.
</p>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> loop</h3>
<div class="outline-text-3" id="text-6-5">
<p>
loop is an iterator. In Ruby an iterator is a method that
expects you to provide a code block.
</p>

<div class="org-src-container">

<pre class="src src-ruby">n = 1
<span style="color: #483d8b;">loop</span> <span style="color: #a020f0;">do</span>
  n += 1
  <span style="color: #a020f0;">next</span> <span style="color: #a020f0;">unless</span> n == 10
  <span style="color: #a020f0;">break</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>

<pre class="example">
nil
</pre>

<p>
Here is how we can write loop
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">my_loop</span>
  <span style="color: #a020f0;">yield</span> <span style="color: #a020f0;">while</span> <span style="color: #a0522d;">true</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>

<pre class="example">
nil
</pre>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> while and until modifiers</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">

<pre class="src src-ruby">n += 1 <span style="color: #a020f0;">until</span> n == 10
n += 1 <span style="color: #a020f0;">while</span> n &lt; 10
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> for</h3>
<div class="outline-text-3" id="text-6-7">
<div class="org-src-container">

<pre class="src src-ruby">numbers = [0, 10, 20, 30, 40, 50]
<span style="color: #a020f0;">for</span> n <span style="color: #a020f0;">in</span> numbers
  <span style="color: #483d8b;">puts</span> n
<span style="color: #a020f0;">end</span>
</pre>
</div>

<table>


<colgroup>
<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">

<col  class="right">
</colgroup>
<tbody>
<tr>
<td class="right">0</td>
<td class="right">10</td>
<td class="right">20</td>
<td class="right">30</td>
<td class="right">40</td>
<td class="right">50</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> curly braces vs do/end code block</h3>
<div class="outline-text-3" id="text-6-8">
<p>
The difference between the two is a difference in precedence
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #483d8b;">puts</span> [1, 2, 3].map { |n| n * 10 }
<span style="color: #b22222;"># </span><span style="color: #b22222;">is like</span>
<span style="color: #483d8b;">puts</span> ([1, 2, 3].map { |n| n * 10 })
</pre>
</div>

<pre class="example">
nil
</pre>

<p>
will ouput 10, 20 , 30
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #483d8b;">puts</span> [1, 2, 3].map <span style="color: #a020f0;">do</span> |n| n * 10 <span style="color: #a020f0;">end</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">is like</span>
<span style="color: #483d8b;">puts</span> ([1, 2, 3].map) <span style="color: #a020f0;">do</span> |n| n * 10 <span style="color: #a020f0;">end</span>
<span style="color: #b22222;"># </span><span style="color: #b22222;">is like</span>
<span style="color: #483d8b;">puts</span> [1, 2, 3].map
</pre>
</div>

<pre class="example">
nil
</pre>

<p>
will output an enumerator
</p>
</div>
</div>

<div id="outline-container-sec-6-9" class="outline-3">
<h3 id="sec-6-9"><span class="section-number-3">6.9</span> each and map</h3>
<div class="outline-text-3" id="text-6-9">
<ul class="org-ul">
<li><code>each</code> returns its receiver
</li>
<li><code>map</code> returns a new array
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-6-10" class="outline-3">
<h3 id="sec-6-10"><span class="section-number-3">6.10</span> Block parameters and scope</h3>
<div class="outline-text-3" id="text-6-10">
<p>
If you have a variable of a given name in scope and also use
that name as one of your block parameters, then the two
variables are not the same as each other.
You can use this to your advantage to make sure a temporary
variable inside a block does not reuse a variable from outside
the block
</p>

<div class="org-src-container">

<pre class="src src-ruby">x = <span style="color: #8b2252;">"original x"</span>
3.times <span style="color: #a020f0;">do</span> |i;x|
  x = i
<span style="color: #a020f0;">end</span>
x
</pre>
</div>

<pre class="example">
original x
</pre>

<p>
<code>;</code> indicates the block needs its own x.
</p>
</div>
</div>

<div id="outline-container-sec-6-11" class="outline-3">
<h3 id="sec-6-11"><span class="section-number-3">6.11</span> rescue</h3>
<div class="outline-text-3" id="text-6-11">
<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">begin</span>
  <span style="color: #b22222;">#</span><span style="color: #b22222;">some code</span>
<span style="color: #a020f0;">rescue</span> <span style="color: #228b22;">ArgumentError</span> =&gt; e
<span style="color: #b22222;">#</span><span style="color: #b22222;">rescue code</span>
  <span style="color: #483d8b;">puts</span> e.backtrace
  <span style="color: #483d8b;">puts</span> e.message
<span style="color: #a020f0;">ensure</span>
  <span style="color: #b22222;">#</span><span style="color: #b22222;">make sure this runs</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>

<pre class="example">
nil
</pre>

<p>
if you put rescue at the end of a method you don't need to say
begin explicitely. Recue will govern the entire method block
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">method_name</span>
  <span style="color: #483d8b;">puts</span> <span style="color: #8b2252;">'hello'</span>
  <span style="color: #a020f0;">rescue</span>
  <span style="color: #483d8b;">puts</span> <span style="color: #8b2252;">'rescued'</span>
<span style="color: #a020f0;">end</span>
</pre>
</div>

<pre class="example">
nil
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aurélien Bottazini</p>
<p class="date">Created: 2014-11-15 Sat 13:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
